app/views/pages/home.html.erb

		Pulsar Studio Fitness! </p>
	<% if current_user.profile.blank? %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1