app/controllers/evaluations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "evaluations" ("altura", "created_at", "dataeval", "imc", "mabdomen", "mantbracod", "mantbracoe", "mbicepsd", "mbicepse", "mbracod", "mbracoe", "mcintura", "mcoxad", "mcoxae", "metbasal", "mgordura", "mmagraa", "mpantd", "mpante", "mquadril", "mtorax", "peso", "pesodes", "pgordura", "pgordurai", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.find(params[:user_id])
		@evaluation = @user.evaluations.new(params[:evaluation])

	  	if @evaluation.save

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		@evaluation = Evaluation.find(params[:id])
		@user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@user = User.find(params[:user_id])
		@evaluation = Evaluation.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "evaluations" SET "dataeval" = '2013-08-16', "updated_at" = '2013-08-16 22:43:41.177685' WHERE "evaluations"."id" = 3
---
	def update
		@user = User.find(params[:user_id])
		@evaluation = Evaluation.find(params[:id])
		#@user.evaluation(params[:evaluation_id])

		if @evaluation.update_attributes(params[:evaluation])