app/controllers/exams_controller.rb

  def index
    @user = User.find(params[:user_id])
    @exams = @user.exams.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "exams".* FROM "exams" WHERE "exams"."user_id" = 2

  def show
    @user = User.find(params[:user_id])

    @exam = @user.exams.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "exams".* FROM "exams" WHERE "exams"."user_id" = 2 AND "exams"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @user = User.find(params[:user_id])

    @exam = @user.exams.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "exams".* FROM "exams" WHERE "exams"."user_id" = 2 AND "exams"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user = User.find(params[:user_id])

    @exam = @user.exams.new(params[:exam])

    respond_to do |format|
      if @exam.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
INSERT INTO "exams" ("acidourico", "androst", "bilirrubina", "catomico", "cknac", "cortisol", "created_at", "creatina", "cristais", "densidade", "estradiol", "fosfatase", "fsh", "ggt", "glicose", "hdl", "hemoglobina", "homocist", "insulina", "ldl", "lh", "lipoprot", "lpo", "ph", "prolactina", "sedimento", "shbg", "soridutoras", "t3", "t4", "teslivre", "testosterona", "tgo", "tgp", "tsh", "updated_at", "ureia", "user_id", "vldl") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:user_id])

    @exam = @user.exams.find(params[:id])

    respond_to do |format|
      if @exam.update_attributes(params[:exam])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "exams".* FROM "exams" WHERE "exams"."user_id" = 2 AND "exams"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "exams" SET "tgo" = 2, "updated_at" = '2013-11-06 17:18:07.536709' WHERE "exams"."id" = 1