app/controllers/postural_assessments_controller.rb

	def create
		@user = User.find(params[:user_id])
		@postural_assessment = @user.postural_assessments.new(params[:postural_assessment])
		if @postural_assessment.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
INSERT INTO "postural_assessments" ("artrose", "cifose", "created_at", "escoliose", "hernia", "image1", "image2", "image3", "lordose", "obs", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def show
		@user = User.find(params[:user_id])
		@postural_assessment = @user.postural_assessments.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "postural_assessments".* FROM "postural_assessments" WHERE "postural_assessments"."user_id" = 2 AND "postural_assessments"."id" = ? LIMIT 1  [["id", "1"]]

	def edit
		@user = User.find(params[:user_id])
		@postural_assessment = @user.postural_assessments.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "postural_assessments".* FROM "postural_assessments" WHERE "postural_assessments"."user_id" = 2 AND "postural_assessments"."id" = ? LIMIT 1  [["id", "1"]]

	def update
		@user = User.find(params[:user_id])
		@postural_assessment = @user.postural_assessments.find(params[:id])

		if @postural_assessment.update_attributes(params[:postural_assessment])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "postural_assessments".* FROM "postural_assessments" WHERE "postural_assessments"."user_id" = 2 AND "postural_assessments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "postural_assessments" SET "image2" = '1276164465966.jpg', "image3" = '1276165522387.jpg', "updated_at" = '2013-10-10 15:55:08.235570' WHERE "postural_assessments"."id" = 1