app/controllers/profiles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "profiles" ("address1", "address2", "birthdate", "created_at", "name", "phone", "signdate", "surname", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "user_id" = NULL, "updated_at" = '2013-06-17 20:46:29.959500' WHERE "profiles"."id" = 2
---
	def create
		@user = User.find(params[:user_id])
		@profile = @user.create_profile(params[:profile])

	  	if @profile.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	def edit
		@user = User.find(params[:user_id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	def show
		@profile = User.find(params[:user_id]).profile

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "profiles" SET "phone" = '123456', "updated_at" = '2013-06-26 00:53:40.998951' WHERE "profiles"."id" = 1
---
	def update
		@user = User.find(params[:user_id])
		@profile = @user.profile

		if @profile.update_attributes(params[:profile])