app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Sat, 01 Jun 2013 23:27:53 UTC +00:00], ["email", "teste@test.com"], ["updated_at", Sat, 01 Jun 2013 23:27:53 UTC +00:00], ["username", "teste"]]
---
	def create
		@user = User.new(params[:user])

		if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
---
	def show
		@user = User.find(params[:id])
		if !@user.profile.blank?

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "username" = 'teste 2', "updated_at" = '2013-06-01 23:46:20.334666' WHERE "users"."id" = 1
---
	def update
		@user = User.find(params[:id])

		if @user.update_attributes(params[:user])